BerriJ/esp32-tang/sdkconfig.defaults
# Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# WiFi Configuration
CONFIG_WIFI_SSID="DoNotSetTheRealValueHere"
CONFIG_WIFI_PASSWORD="PutTheRealPassInTheSdkconfigFile"

# TEE (Trusted Execution Environment)
CONFIG_SECURE_ENABLE_TEE=y
CONFIG_SECURE_TEE_ATTESTATION=y
CONFIG_SECURE_TEE_DEBUG_MODE=n
CONFIG_MBEDTLS_TEE_SEC_STG_ECDSA_SIGN=n

# Custom partition table with TEE support
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
